# Pandas

The pandas package is the most important tool for analysts and data scientists working in Python. We can think of pandas as an extremely powerful excel. 

Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

## Series

Series is buliding block of pandas. It holds information organized by index. 

The difference between Numpy array and pandas series is that Panda series is built on top of Numpy array and it can have a named index.

In [1]:
#import pandas and numpy
import numpy as np
import pandas as pd

### Methods of creating a Pandas series

In [2]:
#initilization
labels = ['a','b','c']
mylist = [10,20,30]
arr = np.array(mylist)
d = {'a':10,'b':20,'c':35}

In [3]:
#with lists
pd.Series(data = mylist) #shift + tab to check the parameter - Keep in mind the first capital on series

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data = mylist,index=labels) # custom labels for each data points.

a    10
b    20
c    30
dtype: int64

In [5]:
#with numpy array
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [6]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [7]:
#with dictinaries
pd.Series(d)

a    10
b    20
c    35
dtype: int64

### Using the index

In [8]:
ser1 = pd.Series(data = [1,2,3,4],index=['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [9]:
ser1['USA']

1

In [10]:
ser2  =pd.Series([1,4,5,6],['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    4
Italy      5
Japan      6
dtype: int64

In [11]:
ser1 + ser2 #add where index matches and nan(not a number) where it does not match

Germany     6.0
Italy       NaN
Japan      10.0
USA         2.0
USSR        NaN
dtype: float64

## DataFrame
DataFrame is multiple panda series that share the same index. This is python version of excel workbook. It is tabular data storage format.Data frame is made up of series objects.

In [12]:
np.random.seed(101) #ensures we have same random number genrated. 
randmat = np.random.randn(5,4)
randmat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [13]:
df = pd.DataFrame(data = randmat) #shift+tab - also keep in mind that capitalization
df

          0         1         2         3
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [14]:
'A B C D'.split() #we can also specify delimiter

['A', 'B', 'C', 'D']

In [15]:
df = pd.DataFrame(data = randmat,index='A B C D E'.split())
df #notice the changes in data frame

          0         1         2         3
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
df = pd.DataFrame(data = randmat,index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Selection and Indexing

In [17]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

As mentioned above, DataFrame Columns are just Series

In [18]:
type(df['W']) #single column

pandas.core.series.Series

In [19]:
df[['W','Y']] #multiple columns

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [20]:
#order can be specified
df[['Z','W','Y']]

          Z         W         Y
A  0.503826  2.706850  0.907969
B  0.605965  0.651118 -0.848077
C -0.589001 -2.018168  0.528813
D  0.955057  0.188695 -0.933237
E  0.683509  0.190794  2.605967

In [21]:
#sql indexing
df.W #not recommeded, python can confuse it with method

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

### Creating new column

In [22]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

### Removing column

In [23]:
df.drop('new',axis =1,inplace = True) #check out axis paramenter in pandas notebook, 
#it will give an error if we don't explicitly specify the axis parameter
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Removing rows

In [24]:
df.drop('C') #axis =0 by default

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Selecting Rows

In [25]:
df.loc['D'] #using label

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [26]:
df.iloc[0] #index-numerical location

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [27]:
df.loc[['A','B']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [28]:
df.iloc[[0,1]]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [29]:
df.loc[['A','B']][['Y','Z']] #slice of DataFrame

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [30]:
df.loc[['A','B'],['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

## Conditional Selection

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
#we want to know where the values are greater than 0
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [33]:
df_bool =df>0
df[df_bool] #only returns where greater than 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
#filtering based of one sigle column
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [35]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [37]:
df[df['W']>0]['Y'].loc['D']#stacking

-0.9332372163009188

In [38]:
cond1 = df['W'] >0
cond2 = df['Y'] >1

Don't use the `and` and `or` for comparision. When dealing with multiple dataset use `&` and `|` respectively

In [39]:
df[(cond1 & cond2)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df[(df['W'] >0) & (df['Y'] >1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

## Index details and customization

In [41]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
df.reset_index() #explicetly specify inplace if you want a permanent change

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [43]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [44]:
new_ind ='CA TX FL AZ WY'.split()
new_ind

['CA', 'TX', 'FL', 'AZ', 'WY']

In [45]:
df['States'] = new_ind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     TX
C -2.018168  0.740122  0.528813 -0.589001     FL
D  0.188695 -0.758872 -0.933237  0.955057     AZ
E  0.190794  1.978757  2.605967  0.683509     WY

In [46]:
df.set_index('States',inplace = True) #anything with pandas, we need to explicitly specify If we want permanent change

In [47]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
TX      0.651118 -0.319318 -0.848077  0.605965
FL     -2.018168  0.740122  0.528813 -0.589001
AZ      0.188695 -0.758872 -0.933237  0.955057
WY      0.190794  1.978757  2.605967  0.683509

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to WY
Data columns (total 4 columns):
W    5 non-null float64
X    5 non-null float64
Y    5 non-null float64
Z    5 non-null float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [49]:
df.dtypes #datatype

W    float64
X    float64
Y    float64
Z    float64
dtype: object

In [50]:
df.describe() #summary stats

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

In [51]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
TX      0.651118 -0.319318 -0.848077  0.605965
FL     -2.018168  0.740122  0.528813 -0.589001
AZ      0.188695 -0.758872 -0.933237  0.955057
WY      0.190794  1.978757  2.605967  0.683509

## Missing Data with pandas

Missing can be handeled by 3 methods:
- Keep the missing data(NaN)
- Drop the missing data
- Fill the missing data with a value

In [52]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [53]:
df.dropna() #Drops rows with nan values in them

     A    B  C
0  1.0  5.0  1

In [54]:
df.dropna(axis =1) #Drops columns with nan values in them

   C
0  1
1  2
2  3

what if we want to specify a threshold before dropping that row/column? For example, drop the row if there are more than 2 incorrect values?

In [55]:
df.dropna(thresh = 2) #requires 2 nan values to drop the row

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [56]:
# to fill the nan values

df.fillna(value = 'Fill Value')

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [57]:
df.fillna(value = 0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [58]:
#better way to fill
df.fillna(value = df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [59]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Group By
Group by involves :
- Splitting the Data
- Apllying some functions
- Combining the data 

Panda will automatically make the grouped by column the index of the resulting DataFrame

In [62]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [64]:
df.groupby(by='Company') #Stored as an object.
#To access it, we need to apply of aggregate function

In [65]:
df.groupby(by='Company').mean() #avrage sales Company

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [66]:
df.groupby(by='Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [67]:
df.groupby(by='Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [68]:
df.groupby(by='Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

## Panda Operations

In [71]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [73]:
df['col2'].unique() #unique values

array([444, 555, 666], dtype=int64)

In [75]:
df['col2'].nunique() #no of unique value

3

In [77]:
df['col2'].value_counts() #unique values and count of it

444    2
555    1
666    1
Name: col2, dtype: int64

In [84]:
#conditional selection
newdf = df[(df['col1']>2) & (df['col2'] ==444)]
newdf

   col1  col2 col3
3     4   444  xyz

Applying

In [85]:
def times_two(num):
    return num**2

In [86]:
df['col1'].apply(times_two) #note - just the name

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [87]:
df['new'] = df['col1'].apply(times_two)
df

   col1  col2 col3  new
0     1   444  abc    1
1     2   555  def    4
2     3   666  ghi    9
3     4   444  xyz   16

In [88]:
#removing coluumn
del df['new']

In [91]:
df.columns #columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [92]:
df.index #indices of DataFrames

RangeIndex(start=0, stop=4, step=1)

In [93]:
df.info() #all info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
col1    4 non-null int64
col2    4 non-null int64
col3    4 non-null object
dtypes: int64(2), object(1)
memory usage: 176.0+ bytes

In [94]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

### Sorting and Ordering a DataFrame:

In [95]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [97]:
df.sort_values(by = 'col2',ascending = False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

In [98]:
df.sort_values(by = 'col2',ascending = True)

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

Note That indices also get reaaranged

## Data Input and Output

In [99]:
pwd # to check current location

'C:\\Users\\amogg\\For_git\\Forecasting series'

In [101]:
pd.read_csv(r'C:\Users\amogg\For_git\Forecasting series\example.csv') #name the exact location of the file
#write 'r' the string to convert the string to raw format

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [104]:
df= pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [105]:
#let's do some operations on it
newdf = df[['a','b']]

In [106]:
newdf.to_csv('new.csv',index = False) #shift+tab , check your folder after running this

In [107]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

## HTML
Pandas can read table tabs off of HTML. 
If you are using the environment from readme,skip the next part. 

Install folowing libraries,if using anaconda distribution just run the following lines on your cmd/terminal:
- conda install lxml
- conda install html5lib
- conda install beautifulsoup4

In [114]:
df = pd.read_html('https://simple.wikipedia.org/wiki/List_of_U.S._states')

In [112]:
df[0].head()

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,Name &postal abbreviation[1],Cities,Established[upper-alpha 1],Population[upper-alpha 2][3],Total area[4],Land area[4],Water area[4],Numberof Reps.,NaN,NaN,NaN,NaN,NaN
1,Capital,Largest[5],mi2,km2,mi2,km2,mi2,km2,NaN,NaN,NaN,NaN,NaN
2,Alabama,AL,Montgomery,Birmingham,"Dec 14, 1819",4874747,52420,135767,50645.0,131171.0,1775.0,4597.0,7.0
3,Alaska,AK,Juneau,Anchorage,"Jan 3, 1959",739795,665384,1723337,570641.0,1477953.0,94743.0,245384.0,1.0
4,Arizona,AZ,Phoenix,"Feb 14, 1912",7016270,113990,295234,113594,294207.0,396.0,1026.0,9.0,NaN

Site Elements are stored as list, If there are multiple tables, run through the site elemnts to find the element you want to find.